---
kind: type
id: T:Autodesk.Revit.DB.FloorFace
source: html/7a34e4cb-0a5d-5299-813b-edfbe364953b.htm
---
# Autodesk.Revit.DB.FloorFace

An enumerated type listing floor face types (top or bottom)

## Syntax (C#)
```csharp
public enum FloorFace
```